--- crates/velesdb-core/src/internal_bench_tests.rs
+++ replace tiny_sparse_index -> crate::index::sparse::SparseInvertedIndex with Default::default()
@@ -54,24 +54,17 @@
 //
 // These live here rather than beside the harness precisely because `--lib` is
 // what the mutation job reads.
 // ===========================================================================
 
 /// Three documents whose term overlap is known, so the expected top-1 is not
 /// a matter of opinion.
 fn tiny_sparse_index() -> crate::index::sparse::SparseInvertedIndex {
-    use crate::index::sparse::{SparseInvertedIndex, SparseVector};
-    let index = SparseInvertedIndex::new();
-    index.insert_batch_chunk(&[
-        (1, SparseVector::new(vec![(1, 1.0), (2, 1.0)])),
-        (2, SparseVector::new(vec![(2, 2.0), (3, 1.0)])),
-        (3, SparseVector::new(vec![(4, 5.0)])),
-    ]);
-    index
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[test]
 fn both_sparse_seams_return_the_documents_the_query_matches() {
     use crate::index::sparse::SparseVector;
     let index = tiny_sparse_index();
     let query = SparseVector::new(vec![(2, 1.0)]);
 
