--- crates/velesdb-core/src/sparse_index/op_count.rs
+++ replace + with * in record_binary_search
@@ -50,17 +50,17 @@
 /// Records the probes `binary_search` performs over `len` entries.
 ///
 /// `ilog2(len) + 1` for a non-empty list, and nothing for an empty one, which
 /// `binary_search` answers without a probe.
 #[inline]
 pub(crate) fn record_binary_search(len: usize) {
     if let Ok(len) = u64::try_from(len) {
         if len > 0 {
-            record_ops(u64::from(len.ilog2()) + 1);
+            record_ops(u64::from(len.ilog2()) * /* ~ changed by cargo-mutants ~ */ 1);
         }
     }
 }
 
 /// Returns the posting inspections counted since the last reset.
 #[must_use]
 pub(crate) fn scoring_ops() -> u64 {
     SCORING_OPS.load(Ordering::Relaxed)
