--- crates/velesdb-core/src/sparse_index/op_count.rs
+++ replace reset_scoring_ops with ()
@@ -63,10 +63,10 @@
 /// Returns the posting inspections counted since the last reset.
 #[must_use]
 pub(crate) fn scoring_ops() -> u64 {
     SCORING_OPS.load(Ordering::Relaxed)
 }
 
 /// Resets the inspection counter to zero.
 pub(crate) fn reset_scoring_ops() {
-    SCORING_OPS.store(0, Ordering::Relaxed);
+    () /* ~ changed by cargo-mutants ~ */
 }
