--- crates/velesdb-core/src/sparse_index/op_count_tests.rs
+++ replace counted -> u64 with 1
@@ -20,19 +20,17 @@
 //! single-threading, the pre-commit hook does not, which is the same gap that
 //! caught #2344's parking tests.
 
 use super::op_count::{record_binary_search, record_ops, reset_scoring_ops, scoring_ops};
 use serial_test::serial;
 
 /// Counts are process-global, so each case starts from a known zero.
 fn counted(f: impl FnOnce()) -> u64 {
-    reset_scoring_ops();
-    f();
-    scoring_ops()
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[test]
 #[serial]
 fn a_binary_search_over_an_empty_list_probes_nothing() {
     // `binary_search` answers an empty slice without a probe. This is also
     // what keeps `len > 0` from becoming `>=`: `ilog2(0)` panics.
     assert_eq!(counted(|| record_binary_search(0)), 0);
