--- crates/velesdb-core/src/sparse_index/search/mod.rs
+++ replace linear_scan_search_for_bench -> Vec<ScoredDoc> with vec![Default::default()]
@@ -190,17 +190,17 @@
 /// only entry point application code has.
 #[cfg(feature = "internal-bench")]
 #[must_use]
 pub(crate) fn linear_scan_search_for_bench(
     index: &SparseInvertedIndex,
     query: &SparseVector,
     k: usize,
 ) -> Vec<ScoredDoc> {
-    linear_scan_search(index, query, k)
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// [`strategy::maxscore_search`] for the bench seam (#2177).
 #[cfg(feature = "internal-bench")]
 #[must_use]
 pub(crate) fn maxscore_search_for_bench(
     index: &SparseInvertedIndex,
     query: &SparseVector,
