--- crates/velesdb-core/src/sparse_index/search/strategy.rs
+++ replace linear_scan_dense -> Vec<ScoredDoc> with vec![]
@@ -104,48 +104,17 @@
 }
 
 /// Dense accumulator variant for linear scan (small doc ID space).
 fn linear_scan_dense(
     k: usize,
     max_doc_id: u64,
     term_postings: &[(f32, Vec<PostingEntry>)],
 ) -> Vec<ScoredDoc> {
-    #[allow(clippy::cast_possible_truncation)]
-    let size = (max_doc_id + 1) as usize;
-    let mut scores = vec![0.0_f32; size];
-    // Membership is a fact about the scan, not about the value: a negative
-    // query weight can drive an accumulated score back to exactly `0.0`, so
-    // testing `scores[idx] == 0.0` would record the same document twice and
-    // let the duplicate evict a genuine result from the top-k heap.
-    let mut seen = vec![false; size];
-    let mut touched: Vec<u64> = Vec::new();
-
-    for (qw, postings) in term_postings {
-        // The whole of this strategy's scoring cost: one inspection per
-        // posting, against MaxScore's terms x log(postings) per candidate.
-        count_ops(postings.len() as u64);
-        for entry in postings {
-            #[allow(clippy::cast_possible_truncation)]
-            let idx = entry.doc_id as usize;
-            if !std::mem::replace(&mut seen[idx], true) {
-                touched.push(entry.doc_id);
-            }
-            scores[idx] += qw * entry.weight;
-        }
-    }
-
-    let mut heap: BinaryHeap<Reverse<ScoredDoc>> = BinaryHeap::with_capacity(k + 1);
-    for &doc_id in &touched {
-        #[allow(clippy::cast_possible_truncation)]
-        let score = scores[doc_id as usize];
-        topk_push(&mut heap, k, doc_id, score);
-    }
-
-    extract_sorted_results(heap)
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Hash map accumulator variant for linear scan (large doc ID space).
 fn linear_scan_hashmap(k: usize, term_postings: &[(f32, Vec<PostingEntry>)]) -> Vec<ScoredDoc> {
     let mut scores: FxHashMap<u64, f32> = FxHashMap::default();
 
     for (qw, postings) in term_postings {
         count_ops(postings.len() as u64);
