--- crates/velesdb-core/src/sparse_index/search/strategy.rs
+++ replace linear_scan_hashmap -> Vec<ScoredDoc> with vec![]
@@ -140,28 +140,14 @@
         topk_push(&mut heap, k, doc_id, score);
     }
 
     extract_sorted_results(heap)
 }
 
 /// Hash map accumulator variant for linear scan (large doc ID space).
 fn linear_scan_hashmap(k: usize, term_postings: &[(f32, Vec<PostingEntry>)]) -> Vec<ScoredDoc> {
-    let mut scores: FxHashMap<u64, f32> = FxHashMap::default();
-
-    for (qw, postings) in term_postings {
-        count_ops(postings.len() as u64);
-        for entry in postings {
-            *scores.entry(entry.doc_id).or_insert(0.0) += qw * entry.weight;
-        }
-    }
-
-    let mut heap: BinaryHeap<Reverse<ScoredDoc>> = BinaryHeap::with_capacity(k + 1);
-    for (&doc_id, &score) in &scores {
-        topk_push(&mut heap, k, doc_id, score);
-    }
-
-    extract_sorted_results(heap)
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[path = "strategy_tests.rs"]
 mod tests;
